# PANDAS

In [1]:
import pandas as pd

In [2]:
s1=pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
type(s1)

pandas.core.series.Series

# Changing index

In [4]:
s2=pd.Series([5,4,3,2,1], index=['A','B','C','D','E'])
s2

A    5
B    4
C    3
D    2
E    1
dtype: int64

In [5]:
type(s2)

pandas.core.series.Series

# Series object  from the Dictionary

In [6]:
s3=pd.Series({'a':10 ,'b': 20 , 'c':30})
s3

a    10
b    20
c    30
dtype: int64

-  ### CHANGING INDEX OF THE SERIES OBJECT OF THE DICTIONARY

In [4]:
s4=pd.Series({'a':10 ,'b': 20 , 'c':30},index=['a','C','b','A','c'])
s4

a    10.0
C     NaN
b    20.0
A     NaN
c    30.0
dtype: float64

## EXTRACT INDIVISUAL VALUES

In [5]:
a1=pd.Series([11,22,33,44,55])
a1[2]

33

In [6]:
a2=pd.Series([11,22,33,] ,index=['a','b','c' ]) 
a2[-2:]

b    22
c    33
dtype: int64

In [7]:
a3=pd.Series([5,4,3,2,1], index=['A','B','C','D','E'])

In [8]:
a3[2:]

C    3
D    2
E    1
dtype: int64

## Basic Math Opertion

In [9]:
# Add Scalar value into the Series

In [10]:
b=pd.Series([11,12,13,14,15,16], index=["a","b","c","d","e","f"])
b

a    11
b    12
c    13
d    14
e    15
f    16
dtype: int64

In [11]:
b+10

a    21
b    22
c    23
d    24
e    25
f    26
dtype: int64

In [12]:
# ADD TWO SERIES OBJECT

In [13]:
a9=pd.Series([55,44,33,22,11])
a8=pd.Series([11,22,33,33,44])
a9

0    55
1    44
2    33
3    22
4    11
dtype: int64

In [14]:
a8

0    11
1    22
2    33
3    33
4    44
dtype: int64

In [15]:
a7=a9+a8
a7

0    66
1    66
2    66
3    55
4    55
dtype: int64

In [16]:
a7-10

0    56
1    56
2    56
3    45
4    45
dtype: int64

In [17]:
a7*2

0    132
1    132
2    132
3    110
4    110
dtype: int64

In [18]:
a7/10

0    6.6
1    6.6
2    6.6
3    5.5
4    5.5
dtype: float64

## EXTRACT ELEMENTS FROM THE SERIES

In [19]:
a9=pd.Series([55,44,33,22,11])
a9

0    55
1    44
2    33
3    22
4    11
dtype: int64

In [20]:
a9[2]

33

In [21]:
a9[4]

11

In [22]:
a9[-2:]

3    22
4    11
dtype: int64

In [23]:
a9[2:]

2    33
3    22
4    11
dtype: int64

# Pandas DataFrame
- Dataframe is a 2- dimentional labbled data structure,

- Dataframe Comprieses of rows and coulmn.

In [25]:
pd.DataFrame({'Name':["Ahsan","Raza", "Ehsen"],'Marks':[80,70,90]} ,index=['A','B','C',])

    Name  Marks
A  Ahsan     80
B   Raza     70
C  Ehsen     90

### <span style= "color:green">Data Frame In bulit functions

* 1- head()  used to see 1st five rows of the data frame 

* 2- shape()    used to see no of Rows and coulmn

* 3- tail()  used to see last five rows of the dataFrame

* 4- describe()  used to see Genral information about Dataframe

In [38]:
book=pd.read_csv("book.csv")
book

        Name   Marks     Book           fee  Distance College
0       Ahsan     50  english     50.000000        10      GC
1    Ali Raza     80     urdu    100.000000        20      GC
2       Ahsan    110  english    200.000000        30      GC
3       Ahsan    140     urdu    266.666667        40      GC
4       Ahsan    170  english    341.666667        50      GC
..        ...    ...      ...           ...       ...     ...
771       ali   7700     urdu  57366.666670      2560      GC
772       ali   7730  english  57591.666670      2570      GC
773       ali   7760     urdu  57816.666670      2580      GC
774     Ahsan   7790  english  58041.666670      2590      GC
775     Ahsan   7820     urdu  58266.666670      2600     NaN

[776 rows x 6 columns]

In [39]:
book.shape

(776, 6)

In [40]:
book.head()

      Name   Marks     Book         fee  Distance College
0     Ahsan     50  english   50.000000        10      GC
1  Ali Raza     80     urdu  100.000000        20      GC
2     Ahsan    110  english  200.000000        30      GC
3     Ahsan    140     urdu  266.666667        40      GC
4     Ahsan    170  english  341.666667        50      GC

In [41]:
book.tail() # Print last 5 Rows

     Name   Marks     Book          fee  Distance College
771    ali   7700     urdu  57366.66667      2560      GC
772    ali   7730  english  57591.66667      2570      GC
773    ali   7760     urdu  57816.66667      2580      GC
774  Ahsan   7790  english  58041.66667      2590      GC
775  Ahsan   7820     urdu  58266.66667      2600     NaN

In [42]:
book.shape

(776, 6)

In [43]:
book.describe()

             Marks           fee     Distance
count   776.000000    776.000000   776.000000
mean   4746.198454  35208.258165  1575.399485
std    2017.279191  15140.744855   672.426397
min      50.000000     50.000000    10.000000
25%    3410.000000  25191.666670  1130.000000
50%    4970.000000  36891.666670  1650.000000
75%    6410.000000  47691.666670  2130.000000
max    7880.000000  58716.666670  2620.000000

## .iloc[] Method

-  Give column index

In [44]:
book=pd.read_csv("book.csv")
book

        Name   Marks     Book           fee  Distance College
0       Ahsan     50  english     50.000000        10      GC
1    Ali Raza     80     urdu    100.000000        20      GC
2       Ahsan    110  english    200.000000        30      GC
3       Ahsan    140     urdu    266.666667        40      GC
4       Ahsan    170  english    341.666667        50      GC
..        ...    ...      ...           ...       ...     ...
771       ali   7700     urdu  57366.666670      2560      GC
772       ali   7730  english  57591.666670      2570      GC
773       ali   7760     urdu  57816.666670      2580      GC
774     Ahsan   7790  english  58041.666670      2590      GC
775     Ahsan   7820     urdu  58266.666670      2600     NaN

[776 rows x 6 columns]

In [33]:
book.head()

      Name   Marks     Book         fee  Distance College
0     Ahsan     50  english   50.000000        10      GC
1  Ali Raza     80     urdu  100.000000        20      GC
2     Ahsan    110  english  200.000000        30      GC
3     Ahsan    140     urdu  266.666667        40      GC
4     Ahsan    170  english  341.666667        50      GC

In [46]:
book.iloc[0:10, 1:]

   Marks     Book          fee  Distance College
0     50  english    50.000000        10      GC
1     80     urdu   100.000000        20      GC
2    110  english   200.000000        30      GC
3    140     urdu   266.666667        40      GC
4    170  english   341.666667        50      GC
5    200     urdu   416.666667        60      GC
6    230  english   491.666667        70      GC
7    260     urdu   566.666667        80      GC
8    290  english  1791.666667        90      GC
9    320     urdu  2016.666667       100      GC

In [35]:
book.iloc[0:2,0:1]

      Name
0     Ahsan
1  Ali Raza

# .loc Method
*  WE GAVE IN  THIS MRTHOD  THE NAME OF COLUMN  NOT INDEX NUMBER

In [47]:
book=pd.read_csv("book.csv")
book

        Name   Marks     Book           fee  Distance College
0       Ahsan     50  english     50.000000        10      GC
1    Ali Raza     80     urdu    100.000000        20      GC
2       Ahsan    110  english    200.000000        30      GC
3       Ahsan    140     urdu    266.666667        40      GC
4       Ahsan    170  english    341.666667        50      GC
..        ...    ...      ...           ...       ...     ...
771       ali   7700     urdu  57366.666670      2560      GC
772       ali   7730  english  57591.666670      2570      GC
773       ali   7760     urdu  57816.666670      2580      GC
774     Ahsan   7790  english  58041.666670      2590      GC
775     Ahsan   7820     urdu  58266.666670      2600     NaN

[776 rows x 6 columns]

In [48]:
book.loc[0:3,]

      Name   Marks     Book         fee  Distance College
0     Ahsan     50  english   50.000000        10      GC
1  Ali Raza     80     urdu  100.000000        20      GC
2     Ahsan    110  english  200.000000        30      GC
3     Ahsan    140     urdu  266.666667        40      GC

In [49]:
book.loc[0:9,("Book","Marks")]

      Book  Marks
0  english     50
1     urdu     80
2  english    110
3     urdu    140
4  english    170
5     urdu    200
6  english    230
7     urdu    260
8  english    290
9     urdu    320

# Droping Column

In [51]:
book.drop("Book", axis=1)

        Name   Marks           fee  Distance College
0       Ahsan     50     50.000000        10      GC
1    Ali Raza     80    100.000000        20      GC
2       Ahsan    110    200.000000        30      GC
3       Ahsan    140    266.666667        40      GC
4       Ahsan    170    341.666667        50      GC
..        ...    ...           ...       ...     ...
771       ali   7700  57366.666670      2560      GC
772       ali   7730  57591.666670      2570      GC
773       ali   7760  57816.666670      2580      GC
774     Ahsan   7790  58041.666670      2590      GC
775     Ahsan   7820  58266.666670      2600     NaN

[776 rows x 5 columns]

# Droping Rows

In [239]:
book.loc[0:9]

      Name   Marks     Book          fee  Distance
0     Ahsan     50  english    50.000000        10
1  Ali Raza     80     urdu   100.000000        20
2     Ahsan    110  english   200.000000        30
3     Ahsan    140     urdu   266.666667        40
4     Ahsan    170  english   341.666667        50
5       ali    200     urdu   416.666667        60
6       ali    230  english   491.666667        70
7       ali    260     urdu   566.666667        80
8     Ahsan    290  english  1791.666667        90
9     Ahsan    320     urdu  2016.666667       100

In [240]:
book.drop([1,2,3,4],axis=0)

     Name   Marks     Book           fee  Distance
0    Ahsan     50  english     50.000000        10
5      ali    200     urdu    416.666667        60
6      ali    230  english    491.666667        70
7      ali    260     urdu    566.666667        80
8    Ahsan    290  english   1791.666667        90
..     ...    ...      ...           ...       ...
257    ali   7760     urdu  57816.666670      2580
258  Ahsan   7790  english  58041.666670      2590
259  Ahsan   7820     urdu  58266.666670      2600
260    ali   7850  english  58491.666670      2610
261    ali   7880     urdu  58716.666670      2620

[258 rows x 5 columns]

## More Pandas Function

- 1- Mean 
- 2- Minimum
- 3-Median
- 4-Maximum

In [242]:
book.mean()

Marks        3965.000000
fee         29339.662853
Distance     1315.000000
dtype: float64

In [243]:
book.min()

Name          Ahsan
Marks            50
Book        english
fee              50
Distance         10
dtype: object

In [244]:
book.median()

Marks        3965.00000
fee         29354.16667
Distance     1315.00000
dtype: float64

In [245]:
book.max()

Name            ali
Marks          7880
Book           urdu
fee         58716.7
Distance       2620
dtype: object

## More Pandas Function

In [246]:
book.head()

      Name   Marks     Book         fee  Distance
0     Ahsan     50  english   50.000000        10
1  Ali Raza     80     urdu  100.000000        20
2     Ahsan    110  english  200.000000        30
3     Ahsan    140     urdu  266.666667        40
4     Ahsan    170  english  341.666667        50

In [247]:
def half(s):
    return s*0.5

In [248]:
book[["Marks","fee"]].apply(half)

      Marks           fee
0      25.0     25.000000
1      40.0     50.000000
2      55.0    100.000000
3      70.0    133.333333
4      85.0    170.833333
..      ...           ...
257  3880.0  28908.333335
258  3895.0  29020.833335
259  3910.0  29133.333335
260  3925.0  29245.833335
261  3940.0  29358.333335

[262 rows x 2 columns]

In [249]:
def double(s):
    return s*2

In [250]:
book[["Marks","fee"]].apply(double_value)

     Marks            fee
0      100     100.000000
1      160     200.000000
2      220     400.000000
3      280     533.333333
4      340     683.333333
..     ...            ...
257  15520  115633.333340
258  15580  116083.333340
259  15640  116533.333340
260  15700  116983.333340
261  15760  117433.333340

[262 rows x 2 columns]

# Value Count

In [251]:
book[('Book')].value_counts()

english    131
urdu       131
Name: Book, dtype: int64

In [252]:
book.sort_values(by='fee')

        Name   Marks     Book           fee  Distance
0       Ahsan     50  english     50.000000        10
1    Ali Raza     80     urdu    100.000000        20
2       Ahsan    110  english    200.000000        30
3       Ahsan    140     urdu    266.666667        40
4       Ahsan    170  english    341.666667        50
..        ...    ...      ...           ...       ...
257       ali   7760     urdu  57816.666670      2580
258     Ahsan   7790  english  58041.666670      2590
259     Ahsan   7820     urdu  58266.666670      2600
260       ali   7850  english  58491.666670      2610
261       ali   7880     urdu  58716.666670      2620

[262 rows x 5 columns]